#+TITLE: System Programming
#+SUBTITLE: Operating System Practice
#+DATE: 2019/1
#+AUTHOR: João Vicente Ferreira Lima
#+EMAIL: jvlima@inf.ufsm.br
#+OPTIONS: H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames, 11pt, presentation]
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.4)
#+TAGS: noexport(n)
#+STARTUP: beamer overview indent
#+BEAMER_FRAME_LEVEL: 2
#+BEAMER_THEME: Madrid
#+BEAMER_HEADER: \institute[UFSM]{Universidade Federal de Santa Maria \\ \url{jvlima@inf.ufsm.br} \\ \url{http://www.inf.ufsm.br/~jvlima}}
#+LATEX_HEADER: \setbeamertemplate{footline}[frame number]
#+LATEX_HEADER: \usecolortheme[named=BrickRed]{structure}
#+LATEX_HEADER: \setbeamertemplate{navigation symbols}{}
#+LATEX_HEADER: \usepackage[american]{babel}
#+LATEX_HEADER: \usepackage{url} \urlstyle{sf}
#+LATEX_HEADER: \useinnertheme{circles}
#+LATEX_HEADER: \let\alert=\structure
#+LATEX_HEADER: \usepackage{wrapfig}
#+LATEX_HEADER: \usepackage{fancyvrb}
#+LATEX_HEADER: \newcommand{\bashcmd}[1]{\textcolor{White}{\colorbox{Sepia}{\texttt{#1}}}}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: 

#+LATEX_HEADER: \lstset{
#+LATEX_HEADER:  backgroundcolor=\color{red!10},
#+LATEX_HEADER:  showstringspaces=false,
#+LATEX_HEADER:  stringstyle=\ttfamily,
#+LATEX_HEADER:  frame=single,
#+LATEX_HEADER:  frameround=tttt,
#+LATEX_HEADER:  mathescape=false
#+LATEX_HEADER: }

#+BEGIN_export latex
\frame<handout:0>
{
  \frametitle{Outline}
  \tableofcontents
}

\makeatletter
\AtBeginSubsection[]
{
  \frame<handout:0>
  {
    \frametitle{Outline}
    \tableofcontents[current,currentsubsection]
  }
}
\makeatother
#+END_export

*** Time
 #+begin_src python :python python3 :results output replace :exports both
import time
from datetime import date

today = date.today()
print( "Today is: ", today)

timestamp = time.time()
print( "Timestamp now: ", timestamp )

time_today = date.fromtimestamp(timestamp)
print( "From timestamp:", time_today )
#+end_src

 #+RESULTS:
 : Today is:  2019-05-13
 : Timestamp now:  1557773061.429696
 : From timestamp: 2019-05-13
*** Time
 #+begin_src python :python python3 :results output replace :exports both
import time
from datetime import date, datetime

t1 = time.time()
print("Sleeping 2 seconds...")
time.sleep(2)
t2 = time.time()

delta = datetime.fromtimestamp(t2-t1)
print("Seconds:", delta.second,
    "Microseconds:", delta.microsecond)
#+end_src

 #+RESULTS:
 : Sleeping 2 seconds...
 : Seconds: 2 Microseconds: 7270

*** Time
 #+begin_src python :python python3 :results output replace :exports both
import os
import time
from datetime import date, datetime

statinfo = os.stat("/etc/hosts")
print("File size is", statinfo.st_size)
datetime_modified  = datetime.fromtimestamp(
    statinfo.st_mtime)
print( "Modified at", datetime_modified )
current = datetime.now()
age = current - datetime_modified 
print("File age:", age)
#+end_src

 #+RESULTS:
 : File size is 236
 : Modified at 2012-02-21 22:57:33
 : File age: 2058 days, 16:50:37.004494

*** Backslash and forward slash
#+begin_src python :python python3 :results output replace :exports both
#!/usr/bin/env python3
import os
mypath = os.path.join('usr', 'local', 'bin')
print(mypath)

myprogs = ['git', 'gcc', 'ld']
for filename in myprogs:
    print(os.path.join(mypath, filename))
#+end_src

#+RESULTS:
: usr/local/bin
: usr/local/bin/git
: usr/local/bin/gcc
: usr/local/bin/ld

*** Directories
Basic directory functions can be found on the =os.path= tools.

The absolute path can be retrived (=os.path.abspath=) or tested
(=os.path.isabs=).
#+begin_src python :python python3 :results output replace :exports both
#!/usr/bin/env python3
import os

print( os.path.abspath('.') )
print( os.path.isabs('.') )
print( os.path.isabs(os.path.abspath('.')) )
#+end_src

#+RESULTS:
: /Users/jvlima/Source/disciplinas/pso/lectures
: False
: True
*** Directories
The relative path can be obtained using the =realpath()= call. For
programs, we can get the base name (=basename()=) or the directory name
(=dirname()=).
#+begin_src python :python python3 :results output replace :exports both
#!/usr/bin/env python3
import os
print( os.path.relpath('/usr/local', '.') )
print( os.getcwd() )

path = '/usr/local/bin/git'
print( os.path.basename(path) )
print( os.path.dirname(path) )
print( path.split(os.path.sep) )
#+end_src

#+RESULTS:
: ../../../../../../usr/local
: /Users/jvlima/Source/disciplinas/pso/lectures
: git
: /usr/local/bin
: ['', 'usr', 'local', 'bin', 'git']

*** Directories
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3
import os

totalSize = 0
for filename in os.listdir('/usr/local/bin'):
    totalSize += os.path.getsize(
        os.path.join('/usr/local/bin', filename))

print(totalSize)
#+end_src

#+RESULTS:
: 276636265

*** Check path
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3
import os

print( os.path.exists('/usr/local') )
print( os.path.isdir('/usr/local') )
print( os.path.isfile('/usr/local') )
#+end_src

#+RESULTS:
: True
: True
: False

*** Basic reading
=read()= function can read all contents.
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3
import os

spamfile = open('/etc/networks')
contents = spamfile.read()
print(contents)
#+end_src

#+RESULTS:
: ##
: # Networks Database
: ##
: loopback	127		loopback-net
: 

*** Read line
You can also read each line using =readline()=.
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3
import os

spamfile = open('/etc/networks')
line = spamfile.readline()
while line != '':
    print(line, end='')
    line = spamfile.readline()
#+end_src

#+RESULTS:
: ##
: # Networks Database
: ##
: loopback	127		loopback-net
: 

*** Read iterator
A =for= loop can also read file lines using a file object.
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3
import os

spamfile = open('/etc/networks')
for line in spamfile:
    print(line, end='')
#+end_src

#+RESULTS:
: ##
: # Networks Database
: ##
: loopback	127		loopback-net
: 

*** Read all contents
Readling all contents using =readlines()= return a list, each list
element is a text line.
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3
import os

spamfile = open('/etc/networks')
contents = spamfile.readlines()
print(contents)
#+end_src

#+RESULTS:
: ['##\n', '# Networks Database\n', '##\n', 'loopback\t127\t\tloopback-net\n']

*** Writing files
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3
import os

baconfile = open('bacon.txt', 'w')
baconfile.write("Hello world\n")
baconfile.write("Bacon is life\n")
baconfile.close()

baconfile = open('bacon.txt')
content = baconfile.read()
baconfile.close()
print(content)
#+end_src

#+RESULTS:
: Hello world
: Bacon is life
: 

*** Saving variables
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3
import shelve

datafile = shelve.open('mydata')
print( list(datafile.keys()) )
print( list(datafile.values()) )
datafile.close()
#+end_src

#+RESULTS:
: ['zoo']
: [['cat', 'bat', 'rat', 'moose', 'chicken', 'elephant']]

*** Zip files
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3
import zipfile, os

filezip = zipfile.ZipFile('tmp.zip')
print( filezip.namelist() )

spaminfo = filezip.getinfo('spam.txt')
print( spaminfo.file_size )
print( spaminfo.compress_size )
filezip.close()
#+end_src

#+RESULTS:
: ['b.txt', 'foo/', 'foo/c.txt', 'foo/d.txt', 'spam.txt']
: 15
: 15

*** Current Working Directory
The CWD is the directory you where in when you typed this command, not
where the script resides.
On the other hand, Python automatically adds the identity of the
script's home directory to the front of the module search path in
order to import any other files.
#+begin_src python :results output replace :exports both
import os
import sys

print('My os.getcwd: ' + os.getcwd())
print('My sys.path : ' + str(sys.path))
#+end_src

#+RESULTS:
: My os.getcwd: /Users/jvlima/pso/lectures
: My sys.path : ['', '/usr/local/Cellar/python3/3.5.2_3/Frameworks/Python.framework/Versions/3.5/lib/python35.zip', '/usr/local/Cellar/python3/3.5.2_3/Frameworks/Python.framework/Versions/3.5/lib/python3.5', '/usr/local/Cellar/python3/3.5.2_3/Frameworks/Python.framework/Versions/3.5/lib/python3.5/plat-darwin', '/usr/local/Cellar/python3/3.5.2_3/Frameworks/Python.framework/Versions/3.5/lib/python3.5/lib-dynload', '/usr/local/lib/python3.5/site-packages']

*** Shell environment variables
Shell variables are available as =os.environ=, a Python dictionary-like
object with one entry per variable in the shell.
#+begin_src python :results output replace :exports both
import os

print(os.environ.keys())
print(list(os.environ.keys()))
print('Variable TMPDIR is: ' + os.environ['TMPDIR'])
#+end_src

#+RESULTS:
: KeysView(environ({'XPC_FLAGS': '0x0', 'PWD': '/Users/jvlima/pso/lectures', 'SCRATCH': '/Users/jvlima', 'TERM': 'dumb', 'TERM_SESSION_ID': '3ECE587D-354D-4C48-BDCB-F7CE89511DB5', '_': '/usr/local/bin/python3', 'SECURITYSESSIONID': '186a8', 'DISPLAY': 'jvlima-imac.inf.ufsm.br', 'TERM_PROGRAM_VERSION': '387', 'LOGNAME': 'jvlima', 'TERM_PROGRAM': 'Apple_Terminal', '__CF_USER_TEXT_ENCODING': '0x1F5:0x0:0x0', 'PERL_MB_OPT': '--install_base "/Users/jvlima/perl5"', '__PYVENV_LAUNCHER__': '/usr/local/bin/python3', 'LC_CTYPE': 'UTF-8', 'SHELL': '/bin/bash', 'LANG': 'en_BR.UTF-8', 'SHLVL': '2', 'HOME': '/Users/jvlima', 'TMPDIR': '/var/folders/m6/d0jhl9fs19j82w4fck9qxs7m0000gn/T/', 'SSH_AUTH_SOCK': '/private/tmp/com.apple.launchd.f9J5Jk4Lgj/Listeners', 'XPC_SERVICE_NAME': '0', 'PATH': '/Users/jvlima/bin:/usr/local/bin:/usr/local/sbin:/usr/bin:/bin:/usr/sbin:/sbin:/usr/local/bin:/Library/TeX/texbin', 'PERL_MM_OPT': 'INSTALL_BASE=/Users/jvlima/perl5', 'Apple_PubSub_Socket_Render': '/private/tmp/com.apple.launchd.ZWqR5XU2KQ/Render', 'USER': 'jvlima'}))
: ['XPC_FLAGS', 'PWD', 'SCRATCH', 'TERM', 'TERM_SESSION_ID', '_', 'SECURITYSESSIONID', 'DISPLAY', 'TERM_PROGRAM_VERSION', 'LOGNAME', 'TERM_PROGRAM', '__CF_USER_TEXT_ENCODING', 'PERL_MB_OPT', '__PYVENV_LAUNCHER__', 'LC_CTYPE', 'SHELL', 'LANG', 'SHLVL', 'HOME', 'TMPDIR', 'SSH_AUTH_SOCK', 'XPC_SERVICE_NAME', 'PATH', 'PERL_MM_OPT', 'Apple_PubSub_Socket_Render', 'USER']
: Variable TMPDIR is: /var/folders/m6/d0jhl9fs19j82w4fck9qxs7m0000gn/T/

*** Shell environment variables
To change or create variables, we can just assign a value like normal
dictionaries.
However, this new value is only visible to the enclosing shell
environment.
#+begin_src python :results output replace :exports both
#!/usr/bin/env python3 
import os

print('Old value: ' + os.environ['USER'])
os.environ['USER'] = 'thing'
print('New value: ' + os.environ['USER'])
#+end_src

#+RESULTS:
: Old value: jvlima
: New value: thing

*** Running a shell command
The =os.system= call lets Python scripts run any sort of command line
program. 
#+begin_src python :results output replace :exports both
import os

ret = os.system('ls ..')
print('Return value: ' + str(ret))
#+end_src

#+RESULTS:
: LICENSE
: README.org
: assignments
: lectures
: scripts
: Return value: 0

The =os.system= returns the exit status, and redirects the command's
output in the session or standard output.
*** Communicating with shell commands
=os.popen= connects to the standard output or input of the command. If
we pass a =w= mode flag to =popen=, we connect to the command's input
stream.
#+begin_src python :results output replace :exports both
import os

text = os.popen('ls ..').read()
print(text)

lines = os.popen('ls ..').readlines()
print(lines)
#+end_src

#+RESULTS:
: LICENSE
: README.org
: assignments
: lectures
: scripts
: 
: ['LICENSE\n', 'README.org\n', 'assignments\n', 'lectures\n', 'scripts\n']

*** =subprocess= module
As we mentioned before, the =subprocess= module intends to replate
several older modules and functions such as =os.system= and =os.spawn*=.

Running a shell command can be done using =run()= (recommended) or =call()=.
#+begin_src python :results output replace :exports both
import subprocess

subprocess.run('date')
subprocess.run(['ls', '..'])
subprocess.run('hello.py', shell=True)
#+end_src

#+RESULTS:
: Wed Nov 16 14:39:46 BRST 2016
: LICENSE
: README.org
: assignments
: lectures
: scripts

*** Threading
Your thread class do not necessarily have to subclass =Thread=. The
thread's target in =threading= may be any type of /callable object/.
#+begin_src python :results output replace :exports both
import threading

class Power:
    def __init__(self, i):
        self.i = i
    def action(self):
        print(self.i ** 32)

obj = Power(2)
threading.Thread(target=obj.action).start()
#+end_src

#+RESULTS:
: 4294967296
*** Threading
#+begin_src python :results output replace :exports both
threads = []
for i in range(100):
    thread = threading.Thread(target=adder, args=())
    thread.start()
    threads.append(thread)

for thread in threads:
    thread.join()
print(count)
#+end_src

#+RESULTS:
: 200
*** Threading
#+begin_src python :results output replace :exports both
addlock = threading.Lock()
threads = []
for i in range(100):
    thread = threading.Thread(target=adder, args=(addlock,))
    thread.start()
    threads.append(thread)

for thread in threads:
    thread.join()
print(count)
#+end_src

#+RESULTS:
: 200

